reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    return ColorLabel::FLOOR;
}

inline const char *ColorLabelName(ColorLabel label) {
    switch (label) {
        case ColorLabel::BLACK:   return "NEGRO";
        case ColorLabel::YELLOW:  return "AMARILLO";
        case ColorLabel::RED:     return "ROJO";
        case ColorLabel::BLUE:    return "AZUL";
        case ColorLabel::FLOOR:   return "GRIS/PISO";
        case ColorLabel::UNKNOWN:
        default:                  return "DESCONOCIDO";
    }
}

// ===========================================================================
//  [8] TAREAS DE HARDWARE
// ===========================================================================

namespace {

// ---------------------------------------------------------------------------
//  8.1  MotorTask — 4 motores a través de 2 drivers L298N
// ---------------------------------------------------------------------------
//  (numeración de subsecciones: 8.1 Motor, 8.2 Gripper, 8.3 Color,
//  8.4 Reflectancia, 8.5 LED — sin ToF, retirado del bus I2C nº0)
// ---------------------------------------------------------------------------

struct Motor {
    uint8_t in1, in2, en, ledc_channel;
};

// Ver la nota larga en firmware-esp32/src/main.cpp: la rueda trasera
// izquierda gira al revés con el cableado físico actual, así que se
// intercambia el orden de IN1/IN2 solo para ese motor.
constexpr Motor kMotorFL = {Pins::L298N_L_IN2, Pins::L298N_L_IN1, Pins::L298N_L_ENA, 0};
constexpr Motor kMotorRL = {Pins::L298N_L_IN3, Pins::L298N_L_IN4, Pins::L298N_L_ENB, 1};
constexpr Motor kMotorFR = {Pins::L298N_R_IN1, Pins::L298N_R_IN2, Pins::L298N_R_ENA, 2};
constexpr Motor kMotorRR = {Pins::L298N_R_IN3, Pins::L298N_R_IN4, Pins::L298N_R_ENB, 3};

void PwmAttach(uint8_t pin, uint8_t channel, uint32_t freqHz, uint8_t resolution) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    (void)channel;
    ledcAttach(pin, freqHz, resolution);
#else
    ledcSetup(channel, freqHz, resolution);
    ledcAttachPin(pin, channel);
#endif
}

void PwmWrite(uint8_t pin, uint8_t channel, uint32_t duty) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    (void)channel;
    ledcWrite(pin, duty);
#else
    (void)pin;
    ledcWrite(channel, duty);
#endif
}

void MotorSetup(const Motor &m) {
    pinMode(m.in1, OUTPUT);
    pinMode(m.in2, OUTPUT);
    PwmAttach(m.en, m.ledc_channel, Pwm::MOTOR_FREQ_HZ, Pwm::MOTOR_RESOLUTION);
    PwmWrite(m.en, m.ledc_channel, 0);
}

// CÓMO CONTROLA DIRECCIÓN UN L298N (para no seguir adivinando el signo a
// ciegas): cada canal tiene DOS entradas lógicas (IN1/IN2 aquí) más una de
// habilitación PWM (EN, aquí `m.en`). La tabla de verdad real del puente H
// es:
//   IN1=HIGH, IN2=LOW  -> gira en un sentido      (a esto llamamos "forward")
//   IN1=LOW,  IN2=HIGH -> gira en el sentido contrario ("no forward")
//   IN1=IN2=LOW        -> rueda libre (freno suave, sin corriente)
//   IN1=IN2=HIGH       -> frenado activo (cortocircuita el motor)
//   EN en 0% de duty   -> el motor NO gira sin importar IN1/IN2 -- por eso
//                         `PwmWrite` recibe abs(speed): la magnitud siempre
//                         es un duty positivo, el signo de `speed` SOLO
//                         decide cuál de las dos combinaciones de IN1/IN2
//                         se manda, nunca "un PWM negativo" (eso no existe).
//
// Con esto claro: el código de abajo YA implementa la tabla de verdad
// correctamente (nunca fue el bug). Lo que puede estar mal es cuál de las
// dos combinaciones corresponde a "avanza" en la realidad -- y eso NO se
// resuelve volteando este booleano cada vez que una sola fase se ve mal:
// la última prueba (invertir para arreglar RETROCEDER_A_ZONA_NEUTRA) hizo
// que el robot arrancara mal en TODAS las fases, así que el booleano se
// revirtió a su valor anterior. Antes de tocarlo de nuevo, hay que medir
// en banco, RUEDA POR RUEDA (no las 4 a la vez), qué combinación de IN1/IN2
// corresponde a qué sentido físico -- kMotorFL ya tiene IN1/IN2
// intercambiados a propósito por su cableado físico (ver el comentario
// junto a su declaración), así que puede que no todas las ruedas compartan
// la misma convención y el problema no sea este booleano global en
// absoluto, sino cuál motor específico está mal cableado o mal
// compensado.
//
// `invertir_direccion`: en vez de seguir tocando la convención global de
// arriba (que ya demostró romper otras fases al voltearla), esto manda
// EXPLÍCITAMENTE la combinación de IN1/IN2 contraria a la que el signo de
// `speed` produciría solo -- pedido explícito para usarlo ÚNICAMENTE en
// RETROCEDER_A_ZONA_NEUTRA, sin afectar cómo se mueve el robot en
// cualquier otra fase.
void MotorApply(const Motor &m, int speed, bool invertir_direccion = false) {
    speed = constrain(speed, -100, 100);
    bool forward = (speed < 0);
    if (invertir_direccion) forward = !forward;
    digitalWrite(m.in1, forward ? HIGH : LOW);
    digitalWrite(m.in2, forward ? LOW  : HIGH);
    PwmWrite(m.en, m.ledc_channel, (uint32_t)abs(speed) * 255u / 100u);
}

void MotorsStop() {
    MotorApply(kMotorFL, 0);
    MotorApply(kMotorRL, 0);
    MotorApply(kMotorFR, 0);
    MotorApply(kMotorRR, 0);
}

void MotorTask(void *) {
    MotorSetup(kMotorFL);
    MotorSetup(kMotorRL);
    MotorSetup(kMotorFR);
    MotorSetup(kMotorRR);
    MotorsStop();

    MotorCommand current{};
    uint32_t last_cmd_ms = millis();

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MOTOR_CONTROL);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        MotorCommand incoming;
        if (xQueueReceive(g_motorCmdQueue, &incoming, 0) == pdTRUE) {
            current = incoming;
            last_cmd_ms = millis();
        }

        // Failsafe: si MissionTask se cuelga (bug, excepción, deadlock en un
        // I2C), esto frena los motores igual que antes frenaba si se caía el
        // enlace con la Raspberry Pi. El origen del riesgo cambió; el
        // mecanismo de defensa, no.
        const bool mission_stale =
            (uint32_t)(millis() - last_cmd_ms) > MISSION_FAILSAFE_TIMEOUT_MS;

