reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    for (;;) {
        ReflectanceReading reading;
        reading.timestamp_ms  = millis();
        reading.left_raw      = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        reading.right_raw     = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);
        reading.left_on_line  = reading.left_raw  > kDarkThreshold;
        reading.right_on_line = reading.right_raw > kDarkThreshold;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  LedTask — LED RGB: indicador puro de la línea/zona de piso
// ---------------------------------------------------------------------------
//  Único trabajo del LED en esta variante: decir sobre qué está parado el
//  robot AHORA MISMO, nada más — ni equipo, ni "veo la bandera".
//    · Piso gris (FLOOR) o sin lectura válida -> apagado.
//    · Amarillo / rojo / azul                 -> ese mismo color, fijo.
//    · Negro (borde)                          -> morado, fijo.

namespace RgbLed {
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD CONFIRMADA con el LED físico: es CÁTODO COMÚN, o sea duty
    // alto = canal más brillante (mismo caso que firmware-esp32/). La
    // constante se conserva por si algún día se cambia el LED por uno de
    // ánodo común.
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    // Color fijo de cada zona -- BLACK incluido, ya no parpadea.
    void ApplyZone(ColorLabel zone) {
        switch (zone) {
            case ColorLabel::YELLOW: SetRaw(255, 170, 0); break;
            case ColorLabel::RED:    SetRaw(255, 0, 0);   break;
            case ColorLabel::BLUE:   SetRaw(0, 0, 255);   break;
            case ColorLabel::BLACK:  SetRaw(160, 0, 200); break;   // morado
            case ColorLabel::FLOOR:
            case ColorLabel::UNKNOWN:
            default:
                SetRaw(0, 0, 0);   // apagado: piso neutro o sin lectura
                break;
        }
    }
}

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);

    ColorLabel zone = ColorLabel::UNKNOWN;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) {
            zone = cmd.zone;
        }

        RgbLed::ApplyZone(zone);

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo (tareas de hardware)

// ===========================================================================
//  [9] MISSIONTASK — el cerebro, sin Raspberry Pi
// ===========================================================================
//
//  Puerto parcial de la lógica de raspberry-pi/src/athena/decision.py a
//  C++: solo la parte de "cargar y depositar la llave". Esta variante NO
//  intenta buscar ni agarrar la bandera del oponente — ver el aviso grande
//  al principio del archivo sobre por qué (se retiró el bus I2C nº0, único
//  sensor con el que esta demo podía intentarlo). La prioridad de no
//  salirse de la pista sí es EXACTAMENTE la misma que allá: salirse de la
//  pista pierde la ronda de inmediato, así que esa regla no puede depender
//  de que nada más ande bien.

namespace Mission {

// Interruptor de emergencia: en false, MissionTask NO mueve motores ni el
// gripper — solo lee los sensores y deja que el LED (LedTask) siga mostrando
// la zona de piso. Sirve para probar sensores en el banco, o para desactivar
// el robot sin desconectarle nada.
//
// Estuvo en false durante unas pruebas en las que el robot se reiniciaba
// solo. La causa resultó ser un problema de CONEXIÓN, no de batería baja
// como se sospechó al principio, así que ya no hay motivo para dejarlo
// apagado: la misión completa está habilitada.
constexpr bool kMotionEnabled = true;

// Velocidades y umbrales — mismo rol que ControlConfig en decision.py,
// pero constexpr porque aquí no hay archivo de configuración que cargar.
constexpr int kVelocidadCrucero     = 70;   // % de PWM al avanzar recto
constexpr int kVelocidadAproximacion = 60;  // % al acercarse / evadir

constexpr uint32_t kStartupDelayMs   = 3000;  // tiempo para cargar la llave y ubicar el robot
constexpr uint32_t kGripperSettleMs  = 400;   // tiempo mecánico para que el servo llegue
// Full stop al llegar a la zona amarilla, antes de retroceder: pedido
// explícito para que el robot se detenga por completo (no una frenada
// suave a mitad de un SetDrive) antes de invertir el sentido de marcha.
constexpr uint32_t kFullStopMs       = 400;
// Retrocede a tiempo fijo justo DESPUÉS de que el sensor trasero detecta la
// zona amarilla, para que el frente (y la llave) quede dentro de la zona
// segura y no más allá de ella. Variable fácil de ajustar: solo este
// número, en milisegundos.
constexpr uint32_t kRetrocesoZonaNeutraMs = 700;
// Evasión de borde negro, en dos tiempos fijos (sin sensor, igual criterio
// que kRetrocesoZonaNeutraMs): retroceder kEvasionRetrocesoMs y luego girar
// ~180° durante kEvasionGiroMs antes de retomar la búsqueda. Números fáciles
// de ajustar en banco según cuánto se pasa/gira de verdad.
constexpr uint32_t kEvasionRetrocesoMs = 500;
constexpr uint32_t kEvasionGiroMs      = 500;

enum class Phase : uint8_t {
    ARRANQUE = 0,
    ASEGURAR_LLAVE,
    BUSCAR_ZONA_NEUTRA,
    // Borde negro detectado durante BUSCAR_ZONA_NEUTRA: retroceder, girar
    // ~180°, y volver a BUSCAR_ZONA_NEUTRA a seguir merodeando.
    EVADIR_BORDE_RETROCESO,
    EVADIR_BORDE_GIRO,
    // Full stop al detectar la zona amarilla, antes de retroceder -- ver
    // kFullStopMs.
    DETENER_ZONA_NEUTRA,
    // Retrocede a tiempo fijo tras detectar la zona amarilla: el sensor
    // TRASERO ya la pasó de largo en el instante en que la detecta, así
    // que sin este paso el frente (y la llave) quedarían más allá de la
    // zona segura, no dentro.
    RETROCEDER_A_ZONA_NEUTRA,
    DEPOSITAR_LLAVE,
    TERMINADO,
};

