reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
// Nombre legible de cada fase, para el log — sin esto, el monitor serial
// solo mostraba el número crudo del enum y había que contar a mano.
inline const char *PhaseName(Phase phase) {
    switch (phase) {
        case Phase::ARRANQUE:            return "ARRANQUE";
        case Phase::ASEGURAR_LLAVE:      return "ASEGURAR_LLAVE";
        case Phase::BUSCAR_ZONA_NEUTRA:  return "BUSCAR_ZONA_NEUTRA";
        case Phase::EVADIR_BORDE_RETROCESO: return "EVADIR_BORDE_RETROCESO";
        case Phase::EVADIR_BORDE_GIRO:   return "EVADIR_BORDE_GIRO";
        case Phase::DETENER_ZONA_NEUTRA: return "DETENER_ZONA_NEUTRA";
        case Phase::RETROCEDER_A_ZONA_NEUTRA: return "RETROCEDER_A_ZONA_NEUTRA";
        case Phase::DEPOSITAR_LLAVE:     return "DEPOSITAR_LLAVE";
        case Phase::TERMINADO:           return "TERMINADO";
        default:                         return "DESCONOCIDA";
    }
}

} // namespace Mission

// Evita depender de que el compilador trate a MotorCommand como agregado
// con inicializadores por defecto (necesita C++14+); igual que hace
// firmware-esp32/src/main.cpp, se asigna campo a campo.
inline void SetDrive(MotorCommand &m, int left, int right, bool invertir_direccion = false) {
    m.mode  = MotorMode::DRIVE;
    m.left  = (int8_t)constrain(left, -100, 100);
    m.right = (int8_t)constrain(right, -100, 100);
    m.invertir_direccion = invertir_direccion;
}

void MissionTask(void *pvTeam) {
    const TeamColor team = *reinterpret_cast<TeamColor *>(pvTeam);

    Mission::Phase phase = Mission::Phase::ARRANQUE;
    Mission::Phase last_logged_phase = phase;
    uint32_t phase_started_ms = millis();

    ColorReading       last_color{};
    ReflectanceReading last_reflect{};
    // Cerrojo: en cuanto el sensor trasero ve amarillo UNA vez estando en
    // BUSCAR_ZONA_NEUTRA, esto pasa a true y ya NUNCA vuelve a false --
    // pedido explícito: "que se detenga por completo al detectar la zona,
    // sin importar si luego empezaste a leer otra cosa" (ej. por inercia
    // el robot sigue deslizándose un poco y el sensor deja de ver amarillo
    // un instante después). Solo importa mientras phase==BUSCAR_ZONA_NEUTRA
    // (ver el switch más abajo): una vez en DETENER_ZONA_NEUTRA en adelante
    // el estado de este cerrojo ya no se vuelve a consultar.
    bool zona_neutra_detectada = false;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MISSION);
    TickType_t last_wake = xTaskGetTickCount();

    DEBUG_LINK.printf("[Mission] equipo = %s\n", team == TeamColor::RED ? "ROJO" : "AZUL");

    for (;;) {
        // --- 0. Refrescar la última lectura de cada sensor -----------------
        // Igual que hacía run_rover.py: se drena toda la cola y solo importa
        // el dato más reciente de cada tipo.
        ColorReading c;
        while (xQueueReceive(g_colorQueue, &c, 0) == pdTRUE) last_color = c;
        ReflectanceReading r;
        while (xQueueReceive(g_reflectQueue, &r, 0) == pdTRUE) last_reflect = r;
        HealthReport h;
        while (xQueueReceive(g_healthQueue, &h, 0) == pdTRUE) {
            DEBUG_LINK.printf("[Mission] tareas colgadas, bitmask=0x%02X\n", h.faulted_tasks_bitmask);
        }

        MotorCommand motor;               // por defecto: STOP
        GripperCommand gripper;
        bool send_gripper = false;

        // Interruptor de batería baja (Mission::kMotionEnabled): si está en
        // false, todo lo de aquí abajo se salta por completo. motor se queda
        // en su valor por defecto (STOP) y gripper nunca se envía — el
        // robot no mueve nada, solo sigue leyendo sensores y mostrando la
        // zona por el LED (eso pasa siempre, fuera de este bloque).
        if (Mission::kMotionEnabled) {

        // --- 0b. Cerrojo de zona neutra: detenerse YA, para siempre -------
        // Se evalúa ANTES del switch(phase) de abajo: en cuanto el sensor
        // trasero ve amarillo una vez estando en BUSCAR_ZONA_NEUTRA, esto
        // cambia de fase inmediatamente y zona_neutra_detectada nunca
        // vuelve a false -- así el resto de la secuencia (parada,
        // retroceso, soltar la llave) no se puede reabrir por una lectura
        // posterior, sin importar qué color se lea después.
        if (!zona_neutra_detectada && phase == Mission::Phase::BUSCAR_ZONA_NEUTRA &&
            last_color.back_valid && last_color.back == ColorLabel::YELLOW) {
            zona_neutra_detectada = true;
            phase = Mission::Phase::DETENER_ZONA_NEUTRA;
            phase_started_ms = millis();
        }

        // DIAGNÓSTICO TEMPORAL: kDarkThreshold nunca se calibró contra el
        // piso/luz reales (ver el TODO junto a su declaración). Este log
        // muestra los valores crudos para comparar contra el umbral.
        // Quitar una vez que kDarkThreshold quede calibrado en banco.
        {
            static uint32_t last_reflect_log_ms = 0;
            if ((uint32_t)(millis() - last_reflect_log_ms) > 500) {
                last_reflect_log_ms = millis();
                DEBUG_LINK.printf(
                    "[Reflect] izq=%u der=%u (umbral=%u) on_line: izq=%d der=%d "
                    "-> zona_neutra_detectada=%d\n",
                    last_reflect.left_raw, last_reflect.right_raw, kDarkThreshold,
                    last_reflect.left_on_line, last_reflect.right_on_line,
                    zona_neutra_detectada);
            }
        }

        // Ayuda a depurar en banco: cambiar de fase se ve en el monitor
        // serial sin tener que instrumentar cada rama.
        if (phase != last_logged_phase) {
            DEBUG_LINK.printf("[Mission] fase -> %s\n", Mission::PhaseName(phase));
            last_logged_phase = phase;
        }

        switch (phase) {

                // -- 2. Cuenta regresiva para cargar la llave a mano --------
                case Mission::Phase::ARRANQUE: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kStartupDelayMs) {
                        phase = Mission::Phase::ASEGURAR_LLAVE;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 3. Asegurar la llave que el operador ya colocó ---------
                case Mission::Phase::ASEGURAR_LLAVE: {
                    gripper.action = GripperAction::CLOSE_LLAVE;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::BUSCAR_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 4. Avanzar/merodear hasta pisar la zona amarilla -------
                // Usa el sensor TRASERO: el delantero se retiró por
                // completo junto con el bus I2C nº0 (ver aviso al
                // principio del archivo). La transición a
                // DETENER_ZONA_NEUTRA ya no se decide aquí: la maneja el
                // cerrojo zona_neutra_detectada, más arriba. Si seguimos
                // viendo esta fase, es que todavía no se detectó el
                // amarillo: seguir avanzando, salvo que el borde negro
                // interrumpa con la maniobra de evasión de abajo.
                //
                // OJO CON EL SIGNO: antes se mandaba kVelocidadCrucero en
                // POSITIVO, pero nunca se probó de verdad en banco porque
                // la evasión de borde (ahora reemplazada por las dos fases
                // de abajo) tapaba este case el 100% del tiempo en toda
                // prueba hecha hasta ahora. La evasión vieja usaba
                // velocidad NEGATIVA sin invertir_direccion y eso sí se
                // confirmó en banco que avanza físicamente -- por eso este
                // avance usa el mismo signo negativo ahora, para no volver
                // a mandar el robot para atrás en cuanto esta fase por fin
                // se ejecute de verdad.
                case Mission::Phase::BUSCAR_ZONA_NEUTRA: {
                    if (last_reflect.left_on_line || last_reflect.right_on_line) {
                        phase = Mission::Phase::EVADIR_BORDE_RETROCESO;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, -Mission::kVelocidadCrucero, -Mission::kVelocidadCrucero);
                    }
                    break;
                }

