reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
                // -- 4·i. Borde negro: retroceder a tiempo fijo -------------
                // Mismo mecanismo (signo negativo + invertir_direccion) ya
                // confirmado en banco para RETROCEDER_A_ZONA_NEUTRA, más
                // abajo -- reutilizado tal cual, sin inventar una tercera
                // combinación de signo/flag.
                case Mission::Phase::EVADIR_BORDE_RETROCESO: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kEvasionRetrocesoMs) {
                        phase = Mission::Phase::EVADIR_BORDE_GIRO;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion,
                                 /*invertir_direccion=*/true);
                    }
                    break;
                }

                // -- 4·ii. Borde negro: girar ~180° y volver a merodear -----
                // Un lado en sentido "avanza" (negativo) y el otro en
                // sentido "retrocede" (positivo, sin necesitar
                // invertir_direccion): con las dos ruedas de un lado
                // girando al revés que las del otro, el robot rota sobre
                // su propio eje en vez de desplazarse. Al terminar, vuelve
                // a BUSCAR_ZONA_NEUTRA a seguir merodeando.
                case Mission::Phase::EVADIR_BORDE_GIRO: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kEvasionGiroMs) {
                        phase = Mission::Phase::BUSCAR_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, -Mission::kVelocidadAproximacion, Mission::kVelocidadAproximacion);
                    }
                    break;
                }

                // -- 4a. Full stop antes de invertir el sentido de marcha ---
                // Pedido explícito: detenerse por completo (motor en STOP,
                // no una frenada a mitad de un SetDrive) antes de
                // retroceder, en vez de pasar directo de avanzar a
                // retroceder. motor se queda en su valor por defecto
                // (STOP): no hace falta llamar a SetDrive aquí.
                case Mission::Phase::DETENER_ZONA_NEUTRA: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kFullStopMs) {
                        phase = Mission::Phase::RETROCEDER_A_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 4b. Retroceder para que el FRENTE (no solo el sensor
                // trasero) quede dentro de la zona amarilla --------------
                // El trasero recién detecta el amarillo cuando ya lo pasó
                // de largo -- sin este paso, la llave (al frente) quedaría
                // más allá de la zona segura, no dentro. Tiempo fijo, sin
                // sensor: Mission::kRetrocesoZonaNeutraMs es el único número
                // que hay que ajustar en banco según cuánto se pasa.
                //
                // invertir_direccion=true: pedido explícito para NO volver
                // a tocar la convención global de MotorApply (voltearla
                // rompió las demás fases, ver la nota grande junto a
                // MotorApply) y en su lugar forzar la combinación de
                // IN1/IN2 contraria SOLO en esta fase, la única que
                // necesita moverse hacia atrás de verdad.
                case Mission::Phase::RETROCEDER_A_ZONA_NEUTRA: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kRetrocesoZonaNeutraMs) {
                        phase = Mission::Phase::DEPOSITAR_LLAVE;
                        phase_started_ms = millis();
                    } else {
                        // OJO: el signo aquí SÍ importa incluso con
                        // invertir_direccion=true -- son dos inversiones
                        // independientes (signo de `speed`, y el flag) y
                        // hay que combinarlas bien. La evasión de borde ya
                        // demostró en banco que speed NEGATIVO sin invertir
                        // produce "avanza" físicamente; para obtener el
                        // estado contrario hay que partir de ESE mismo
                        // signo negativo y sí invertirlo -- usar positivo
                        // aquí (como se hizo antes) cancela las dos
                        // inversiones y vuelve a producir "avanza".
                        SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion,
                                 /*invertir_direccion=*/true);
                    }
                    break;
                }

                // -- 5. Soltar la llave: fin de la misión de esta demo ------
                // (sin bus I2C nº0 no hay forma de buscar la bandera del
                // oponente -- ver el aviso grande al principio del
                // archivo -- así que la secuencia termina aquí).
                case Mission::Phase::DEPOSITAR_LLAVE: {
                    gripper.action = GripperAction::OPEN;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::TERMINADO;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 6. Misión completa: quieto -------------------------------
                case Mission::Phase::TERMINADO:
                default:
                    break;
        }

        } // if (Mission::kMotionEnabled)

        xQueueOverwrite(g_motorCmdQueue, &motor);
        if (send_gripper) xQueueSend(g_gripperCmdQueue, &gripper, 0);

        // Sensor TRASERO -- único que queda, ver la nota en BUSCAR_ZONA_NEUTRA.
        LedCommand led;
        led.zone = last_color.back_valid ? last_color.back : ColorLabel::UNKNOWN;
        xQueueOverwrite(g_ledCmdQueue, &led);

        Heartbeat(TaskId::MISSION);
        vTaskDelayUntil(&last_wake, period);
    }
}

